In [2]:
#import necessary libraries
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns
%matplotlib inline
import plotly.express as px
import warnings
warnings.filterwarnings('ignore')
import glob


file_paths = glob.glob('C:/Users/anand/Documents/Dataset/*')  #Get list of file paths in specified directory


for file_path in file_paths:      #Iteration through list of file paths 
    print(file_path)              #printing file path

C:/Users/anand/Documents/Dataset\Assignment-1_Data.csv
C:/Users/anand/Documents/Dataset\Assignment-1_Data.xlsx

In [3]:
 # Reading a CSV file using Pandas library
dataframe = pd.read_csv('C:/Users/anand/Documents/Dataset\Assignment-1_Data.csv', delimiter=';')

In [4]:
#creation of summary dataframe to describe the structure of dataframe 'Dataframe'
summary = pd.DataFrame({
    'Column Name': dataframe.columns,
    'Data Type': dataframe.dtypes,
    'Non-Null Count': dataframe.count(),
    'Null Count': dataframe.isnull().sum(),
    'Unique Values': dataframe.nunique(),
})

print(summary)    #print summary dataframe

           Column Name Data Type  Non-Null Count  Null Count  Unique Values
BillNo          BillNo    object          522064           0          21665
Itemname      Itemname    object          520609        1455           4185
Quantity      Quantity     int64          522064           0            690
Date              Date    object          522064           0          19641
Price            Price    object          522064           0           1285
CustomerID  CustomerID   float64          388023      134041           4297
Country        Country    object          522064           0             30

In [5]:
null_counts = dataframe.apply(lambda x: x.isnull().sum())   #calculating no of null values in each column in the dataframe
print(null_counts)      #print counts of null values in each column

BillNo             0
Itemname        1455
Quantity           0
Date               0
Price              0
CustomerID    134041
Country            0
dtype: int64

In [6]:
#Filter the dataframe such that 'Quantity' is less than or equal to 0 and displaying first 5 rows of result in table format.
result = dataframe[dataframe['Quantity'] <= 0].head(5).to_string(index=False)

print(result) #print result

BillNo Itemname  Quantity             Date Price  CustomerID        Country
536589      NaN       -10 01.12.2010 16:50     0         NaN United Kingdom
536764      NaN       -38 02.12.2010 14:42     0         NaN United Kingdom
536996      NaN       -20 03.12.2010 15:30     0         NaN United Kingdom
536997      NaN       -20 03.12.2010 15:30     0         NaN United Kingdom
536998      NaN        -6 03.12.2010 15:30     0         NaN United Kingdom

In [7]:
#Filter the dataframe where the Quantity is greater than zero
dataframe = dataframe[dataframe['Quantity'] > 0]

In [8]:
#Filter the dataframe where price is less than or equal to 0 and display the first 5 rows
dataframe.loc[dataframe['Price']<='0'][:5]

,BillNo,Itemname,Quantity,Date,Price,CustomerID,Country
613,536414,NaN,56,01.12.2010 11:52,0,NaN,United Kingdom
1937,536545,NaN,1,01.12.2010 14:32,0,NaN,United Kingdom
1938,536546,NaN,1,01.12.2010 14:33,0,NaN,United Kingdom
1939,536547,NaN,1,01.12.2010 14:33,0,NaN,United Kingdom
1940,536549,NaN,1,01.12.2010 14:34,0,NaN,United Kingdom

In [9]:
#Filter the dataframe such that it contains only the rows where price is greater than 0
dataframe=dataframe.loc[dataframe['Price']>'0']

In [10]:
#Define list of items to filter in dataframe
item_names = ['POSTAGE', 'DOTCOM POSTAGE', 'Adjust bad debt', 'Manual']

#use query method to filter rows that matches with the item_names
result = dataframe.query('Itemname == @item_names[0] | Itemname == @item_names[1] | Itemname == @item_names[2] | Itemname == @item_names[3]').head().to_string(index=False)

#print the filtered result
print(result)

BillNo       Itemname  Quantity             Date  Price  CustomerID        Country
536370        POSTAGE         3 01.12.2010 08:45     18     12583.0         France
536403        POSTAGE         1 01.12.2010 11:27     15     12791.0    Netherlands
536527        POSTAGE         1 01.12.2010 13:04     18     12662.0        Germany
536544 DOTCOM POSTAGE         1 01.12.2010 14:32 569,77         NaN United Kingdom
536569         Manual         1 01.12.2010 15:35   1,25     16274.0 United Kingdom

In [11]:
#Filter the dataframe to remove rows where Itemname matches with any one of values in item_names
dataframe=dataframe.loc[(dataframe['Itemname']!='POSTAGE')&(dataframe['Itemname']!='DOTCOM POSTAGE')&(dataframe['Itemname']!='Adjust bad debt')&(dataframe['Itemname']!='Manual')]

In [12]:
#Calculate count of null values for each column in the 'dataframe' and display counts of null values
dataframe.isnull().sum()

BillNo             0
Itemname           0
Quantity           0
Date               0
Price              0
CustomerID    130813
Country            0
dtype: int64

In [13]:
dataframe=dataframe.fillna('-')  #Replaces NaN in dataframe to '-'
dataframe.isnull().sum()  #display count of null values

BillNo        0
Itemname      0
Quantity      0
Date          0
Price         0
CustomerID    0
Country       0
dtype: int64

In [14]:
# Extract and create a new 'Year' column from the 'Date' column by splitting based on the '.' separator
dataframe['Year']=dataframe['Date'].apply(lambda x:x.split('.')[2])

#Split the 'Year' column to remove any time information (if present)
dataframe['Year']=dataframe['Year'].apply(lambda x:x.split(' ')[0])

# Extract and create a new 'Month' column from the 'Date' column by splitting based on the '.' separator
dataframe['Month']=dataframe['Date'].apply(lambda x:x.split('.')[1])

#Display of updated dataframe
dataframe.head()

,BillNo,Itemname,Quantity,Date,Price,CustomerID,Country,Year,Month
0,536365,WHITE HANGING HEART T-LIGHT HOLDER,6,01.12.2010 08:26,"2,55",17850.0,United Kingdom,2010,12
1,536365,WHITE METAL LANTERN,6,01.12.2010 08:26,"3,39",17850.0,United Kingdom,2010,12
2,536365,CREAM CUPID HEARTS COAT HANGER,8,01.12.2010 08:26,"2,75",17850.0,United Kingdom,2010,12
3,536365,KNITTED UNION FLAG HOT WATER BOTTLE,6,01.12.2010 08:26,"3,39",17850.0,United Kingdom,2010,12
4,536365,RED WOOLLY HOTTIE WHITE HEART.,6,01.12.2010 08:26,"3,39",17850.0,United Kingdom,2010,12

In [15]:
#Replace , with . and convert Price column value to float
dataframe['Price']=dataframe['Price'].str.replace(',','.').astype('float64')

#Create and Calculate Total Price by multiplying 'Quantity' and 'Price' columns
dataframe['Total price']=dataframe.Quantity*dataframe.Price

#Display updated dataframe
dataframe.head()

,BillNo,Itemname,Quantity,Date,Price,CustomerID,Country,Year,Month,Total price
0,536365,WHITE HANGING HEART T-LIGHT HOLDER,6,01.12.2010 08:26,2.55,17850.0,United Kingdom,2010,12,15.30
1,536365,WHITE METAL LANTERN,6,01.12.2010 08:26,3.39,17850.0,United Kingdom,2010,12,20.34
2,536365,CREAM CUPID HEARTS COAT HANGER,8,01.12.2010 08:26,2.75,17850.0,United Kingdom,2010,12,22.00
3,536365,KNITTED UNION FLAG HOT WATER BOTTLE,6,01.12.2010 08:26,3.39,17850.0,United Kingdom,2010,12,20.34
4,536365,RED WOOLLY HOTTIE WHITE HEART.,6,01.12.2010 08:26,3.39,17850.0,United Kingdom,2010,12,20.34

In [16]:
# Groups 'Year' and 'Month' and calculate the sum of 'Total price' for each group
dataframe.groupby(['Year','Month'])['Total price'].sum()

Year  Month
2010  12        778386.780
2011  01        648311.120
      02        490058.230
      03        659979.660
      04        507366.971
      05        721789.800
      06        710158.020
      07        642528.481
      08        701411.420
      09        981408.102
      10       1072317.070
      11       1421055.630
      12        606953.650
Name: Total price, dtype: float64

In [17]:
#Filter the dataframe to exclude rows where 'Year' is equal to '2010' in order to perform data analytic properly. 
dataframe = dataframe[dataframe['Year'] != '2010']